In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv(r'E:\Data_for_Analysis\Bank-Customers_Data.csv')

In [4]:
df

,Customer ID,Name,Surname,Gender,Age,Region,Job Classification,Date Joined,Balance
0,100000001,Simon,Walsh,Male,21,England,White Collar,05.Jan.15,113810.15
1,400000002,Jasmine,Miller,Female,34,Northern Ireland,Blue Collar,06.Jan.15,36919.73
2,100000003,Liam,Brown,Male,46,England,White Collar,07.Jan.15,101536.83
3,300000004,Trevor,Parr,Male,32,Wales,White Collar,08.Jan.15,1421.52
4,100000005,Deirdre,Pullman,Female,38,England,Blue Collar,09.Jan.15,35639.79
...,...,...,...,...,...,...,...,...,...
4009,200004010,Sam,Lewis,Male,64,Scotland,Other,30.Dec.15,19711.66
4010,200004011,Keith,Hughes,Male,52,Scotland,Blue Collar,30.Dec.15,56069.72
4011,200004012,Hannah,Springer,Female,50,Scotland,Other,30.Dec.15,59477.82
4012,200004013,Christian,Reid,Male,51,Scotland,Blue Collar,30.Dec.15,239.45
4013,300004014,Stephen,May,Male,33,Wales,Blue Collar,30.Dec.15,30293.19

In [5]:
df.head()

,Customer ID,Name,Surname,Gender,Age,Region,Job Classification,Date Joined,Balance
0,100000001,Simon,Walsh,Male,21,England,White Collar,05.Jan.15,113810.15
1,400000002,Jasmine,Miller,Female,34,Northern Ireland,Blue Collar,06.Jan.15,36919.73
2,100000003,Liam,Brown,Male,46,England,White Collar,07.Jan.15,101536.83
3,300000004,Trevor,Parr,Male,32,Wales,White Collar,08.Jan.15,1421.52
4,100000005,Deirdre,Pullman,Female,38,England,Blue Collar,09.Jan.15,35639.79

In [6]:
df.describe()

        Customer ID          Age        Balance
count  4.014000e+03  4014.000000    4014.000000
mean   1.696831e+08    38.611111   39766.448274
std    8.865374e+07     9.819121   29859.489192
min    1.000000e+08    15.000000      11.520000
25%    1.000020e+08    31.000000   16115.367500
50%    1.000038e+08    37.000000   33567.330000
75%    2.000031e+08    45.000000   57533.930000
max    4.000038e+08    64.000000  183467.700000

In [7]:
df.isnull().sum()

Customer ID           0
Name                  0
Surname               0
Gender                0
Age                   0
Region                0
Job Classification    0
Date Joined           0
Balance               0
dtype: int64

In [8]:
df.shape

(4014, 9)

In [10]:
df.columns

Index(['Customer ID', 'Name', 'Surname', 'Gender', 'Age', 'Region',
       'Job Classification', 'Date Joined', 'Balance'],
      dtype='object')

In [ ]:
#1. Mention the customer id who have white collar job?

In [3]:
df1=df.loc[df['Job Classification']=="White Collar",['Customer ID','Job Classification']]

In [3]:
#2. Mention the full name of customer having age of 20?

In [4]:
df1=df.loc[df['Age']==20,['Name','Surname','Age']]

In [5]:
df1

          Name    Surname  Age
81        Neil  Robertson   20
131      James   Marshall   20
339    Rebecca       Nash   20
466     Angela   Morrison   20
512        Amy    Wilkins   20
574    Michael   Davidson   20
737    Natalie     Tucker   20
1756   Cameron     Arnold   20
2197     Molly     Fisher   20
2233   Heather     Hughes   20
2313    Hannah       Hill   20
2481    Yvonne      Poole   20
2520  Penelope    Parsons   20
2781  Nicholas   Buckland   20
3369   Jessica      Lyman   20
3379    Victor    Cameron   20
3470     Wendy     Martin   20
3556      John  Mackenzie   20
3660     Keith       Reid   20
3892      Lisa      Terry   20

In [7]:
df1.count()

Name       20
Surname    20
Age        20
dtype: int64

In [ ]:
#3. Mention the region where male customer are dominating?

In [8]:
d=df.loc[df['Gender']=='Male',['Gender','Region']].max()
d

Gender     Male
Region    Wales
dtype: object

In [9]:
d.count()

2

In [ ]:
#4. Mention the job where female customer are dominating?

In [12]:
df.loc[df['Gender']=='Female',['Job Classification','Gender']].max()

Job Classification    White Collar
Gender                      Female
dtype: object

In [ ]:
#5. Mention the max and min age of customers on the basis of region?

In [50]:
df[['Region','Age']].aggregate([min,max])

      Region  Age
min  England   15
max    Wales   64

In [ ]:
#6. Mention the max & min age of customer on the basis of gender?

In [51]:
df[['Gender','Age']].aggregate([min,max])

     Gender  Age
min  Female   15
max    Male   64

In [ ]:
#7. Mention the max & min age of customer on the basis of job?

In [52]:
df[['Job Classification','Age']].aggregate([min,max])

    Job Classification  Age
min        Blue Collar   15
max       White Collar   64

In [ ]:
#8. Name the customer id & customer name having highest balance?

In [56]:
df[['Customer ID','Name','Balance']].aggregate([max])

     Customer ID Name   Balance
max    400003848  Zoe  183467.7

In [ ]:
#9. Name the customer id & customer name having lowest balance?

In [60]:
df[['Customer ID','Name','Balance']].aggregate([min])

     Customer ID     Name  Balance
min    100000001  Abigail    11.52

In [66]:
#10. Mention the region where customers have blue collar job?

df.loc[df['Job Classification']=="Blue Collar",['Region','Job Classification']]

                Region Job Classification
1     Northern Ireland        Blue Collar
4              England        Blue Collar
5                Wales        Blue Collar
6              England        Blue Collar
18             England        Blue Collar
...                ...                ...
4006           England        Blue Collar
4007           England        Blue Collar
4010          Scotland        Blue Collar
4012          Scotland        Blue Collar
4013             Wales        Blue Collar

[1049 rows x 2 columns]

In [ ]:
#11. According to region name the customer with max balance and also mention their date of joining?

In [67]:
df[['Region','Date Joined','Balance']].aggregate([max])

    Region Date Joined   Balance
max  Wales   31.Oct.15  183467.7

In [ ]:
#12.Name the customer with customer id who belong to "Wales"?

In [73]:
df.loc[df['Region']=='Wales',['Name','Customer ID','Region']]

           Name  Customer ID Region
3        Trevor    300000004  Wales
5           Ava    300000006  Wales
8          Ruth    300000009  Wales
14    Madeleine    300000015  Wales
20        Boris    300000021  Wales
...         ...          ...    ...
3982      Bella    300003983  Wales
3999   Benjamin    300004000  Wales
4000  Gabrielle    300004001  Wales
4001     Austin    300004002  Wales
4013    Stephen    300004014  Wales

[520 rows x 3 columns]

In [ ]:
#13.Name the customer having highest balance on the basis of gender

In [75]:
df[['Name','Gender','Balance']].aggregate([max])

    Name Gender   Balance
max  Zoe   Male  183467.7

In [ ]:
#14.Name the customer having highest balance on the basis of age?

In [78]:
df[['Name','Age','Balance']].aggregate([max])

    Name  Age   Balance
max  Zoe   64  183467.7

In [ ]:
#15. How many customers are of age less than 34 years with white collar job?

In [105]:
df.loc[(df["Age"] <34) & (df["Job Classification"] == 'White Collar'), ["Age",'Job Classification']]

      Age Job Classification
0      21       White Collar
3      32       White Collar
8      33       White Collar
12     24       White Collar
27     33       White Collar
...   ...                ...
3988   26       White Collar
3990   30       White Collar
3991   18       White Collar
3992   29       White Collar
4001   30       White Collar

[818 rows x 2 columns]

In [ ]:
#16. How many customers are of age greater than 46 years with blue collar job?

In [14]:
df.loc[(df['Age']>46) & (df['Job Classification']=='Blue Collar'),['Age','Job Classification']]

      Age Job Classification
21     58        Blue Collar
23     52        Blue Collar
25     55        Blue Collar
28     50        Blue Collar
42     49        Blue Collar
...   ...                ...
3978   49        Blue Collar
3995   55        Blue Collar
3996   53        Blue Collar
4010   52        Blue Collar
4012   51        Blue Collar

[368 rows x 2 columns]